{
  "education": [
    {
      "awards_achievements": [
        "Master degree with 83%"
      ],
      "degree": "Master Degree",
      "department": "Computer Application",
      "duration": "2010-2013",
      "school_name": "University of Calcutta"
    },
    {
      "awards_achievements": [
        "Honors in Mathematics"
      ],
      "degree": "Bachelor Degree",
      "department": "Mathematics",
      "duration": "2006-2009",
      "school_name": "University of Calcutta"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SanjuktaChoudhury",
  "highlighted_projects": [
    {
      "description": "Collected the IMDB data set from Kaggle and cleaned the data set by identifying duplicate or irrelevant values and removing them. I also searched for missing values, fill them in and sorted the values to get a complete and clean data set. Analyzed and Visualized through microsoft excel and a series of interactive tableau dashboards that focused on identifying the top genres, actors and directors over the past 2 decades with-respect to revenues and profits for the studios to make a strategic decision regarding production and financing. Created a Tableau Story with an executive style of presentation.",
      "git_url": "https://github.com/SanjuktaCh/Data-Analytics-Project",
      "name": "IMDB Data Analysis for Future Investment"
    },
    {
      "description": "Customer Churn (Customer attrition) is the most challenging problem for businesses such as credit cards or banking companies. To find the potential churning customers, performed analysis on the customer credit card dataset using Python and Tableau to understand the reasons for churn rate so that the company can take actions for growth and financial stability. Collected the data set from Kaggle and pre-processed the data using Python. Statistically analyzed the data using Python (Pandas, NumPy, Matplotlib, Seaborn, Scikit-learn). Built a churn prediction model that achieved 80% accuracy on test data using Random Forest Classifier. Created a Tableau Story with an executive style of presentation.",
      "git_url": "https://github.com/SanjuktaCh/Data-Analytics-Project",
      "name": "Credit Card Customer Attrition Analysis"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Created a Cluster Monitor program that monitors and stores the host machine's hardware information and resource usage. Elicited the technical requirements, created the BRD and SRD documents defining the project scope, stakeholders, functional and nonfunctional requirements with system sequence diagrams.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": "Created a SRD for Jarvis trading team who wants a new online trading application for stock brokers to replace their old legacy system, a monolithic application that is hard to scale and manage. Worked with clients for requirement gathering and analysis, developed scope and incorporated changes in a highly agile environment Developed the project document with proper architectural diagrams for the developers to understand. Created the data modeling and ER diagrams for the database team.",
      "git_url": "",
      "name": "BSA Project"
    }
  ],
  "name": "Sanjukta Choudhury",
  "others": [
    {
      "bullets": [
        "Data Analytics"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Photography",
        "Event Management",
        "Volunteer - Worked in a retail store"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Worked on a project based on Linux/SQL to help Jarvis Linux Cluster team manage their cluster entities. Worked with Stakeholders and Jarvis Team to create a SRD Document on a new trading application. Collaborated with team members in a scrum team to carry out projects successfully.",
      "duration": "2022-present",
      "title": "Business System Analyst"
    },
    {
      "company": "Kovair Software Pvt Ltd",
      "description": "Requirement Gathering and Analysis using Python Tool (Pandas, NumPy, Matplotlib, Seaborn). Providing Demo to the prospective clients using Microsoft Excel, Microsoft PowerPoint, and Tableau. Leading and Presenting POC. Configuring the Product as per Customer's Requirement. Preparing SOW, Use Case and User Guide Documentation. Implemented new sections of the ALM product using .Net Framework and C#. New UI implementation of some parts of the product using JavaScript, ExtJS, jQuery, HTML5 and CSS3. Bug Fixing, both Front End and Back End.",
      "duration": "2013-2016",
      "title": "Software Engineer"
    }
  ],
  "skills": {
    "Business Skills": [
      "Dedicated team player demonstrating initiative and independence",
      "Strong communication, organizational and interpersonal skills",
      "Strong time management skills and the ability to manage multiple assignments",
      "Reliable, consistent, flexible, and adaptable"
    ],
    "Technical Skills": [
      "RDBMS/SQL, C#, PostgreSQL, Python(Pandas, NumPy, Matplotlib, Seaborn), Flask, Heroku, LINUX/Bash",
      "Data Modeling/Mapping",
      "Data Analytics",
      "Microsoft Excel, Microsoft PowerPoint, Tableau",
      "TFS, Github",
      "HP-QC, HP-ALM, Kovair ALM, Rally, RQM, RTC"
    ]
  },
  "summary": "I completed my bachelors in Mathematics honors and have a master degree in Computer Application and recently acquired a Data Analytics Certification from SpringBoard School of Data Analytics. I started my career as a Software Developer where I worked for 3.5 years and am currently working as Business System Analyst at Jarvis. My experience with coding along with strong analytical skills helped me interacted with stakeholders, and customers to understand business requirements and project scopes to create Business and Software Documents. I have always been passionate about numbers and statistical analysis and use this skills to find new insights not only professionally but in every aspect of life. I am excited to combine my previous Software Developer experience with newly acquired Data Analytical skills to enable data decisions making at scale."
}
